youkorr/movie/components/movie/esp32_ffmpeg.c
#include "esp32_ffmpeg.h"
#include <string.h>
#include <stdlib.h>
#include <sys/unistd.h>
#include <sys/stat.h>
#include "esp_log.h"
#include "esp_http_client.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_heap_caps.h"


static const char *TAG = "esp32_ffmpeg";

// Structures pour le format AVI
typedef struct {
    char id[4];
    uint32_t size;
} riff_chunk_t;

typedef struct {
    uint32_t chunk_size;
    uint16_t width;
    uint16_t height;
    uint16_t planes;
    uint16_t bit_count;
    uint32_t compression;
    uint32_t image_size;
    uint32_t x_pels_per_meter;
    uint32_t y_pels_per_meter;
    uint32_t clr_used;
    uint32_t clr_important;
} avi_bitmap_info_header_t;

// Structure du contexte
struct esp_ffmpeg_context_s {
    char *source_url;
    esp_ffmpeg_source_type_t source_type;
    esp_ffmpeg_frame_callback_t frame_callback;
    void *user_data;
    bool running;
    TaskHandle_t task_handle;
    SemaphoreHandle_t mutex;

    // Pour les fichiers
    FILE *input_file;

    // Pour HTTP
    esp_http_client_handle_t http_client;

    // Buffer de décodage
    uint8_t *buffer;
    size_t buffer_size;

    // Info vidéo
    int width;
    int height;
    int frame_count;
    bool is_mjpeg;
    
    // Pour AVI
    bool is_avi;
    long avi_data_offset;     // Offset où commencent les données vidéo
    long avi_current_offset;  // Offset courant de lecture
    uint32_t avi_frame_size;  // Taille moyenne des frames
    uint32_t avi_total_frames; // Nombre total de frames
    // For MP4 and other formats using FFmpeg
    bool is_mp4;
    AVFormatContext *fmt_ctx;
    AVCodecContext *codec_ctx;
    AVStream *video_stream;
    struct SwsContext *sws_ctx;
    AVPacket *packet;
    AVFrame *frame;
    int video_stream_idx;
};

static void init_ffmpeg_libs() {
    static bool initialized = false;
    if (!initialized) {
        av_register_all();
        avcodec_register_all();
        avformat_network_init();
        initialized = true;
        ESP_LOGI(TAG, "FFmpeg libraries initialized");
    }
}
static bool open_mp4_source(esp_ffmpeg_context_t *ctx) {
    // Initialize FFmpeg components
    ctx->fmt_ctx = avformat_alloc_context();
    if (!ctx->fmt_ctx) {
        ESP_LOGE(TAG, "Failed to allocate format context");
        return false;
    }
    
    // Open input
    if (avformat_open_input(&ctx->fmt_ctx, ctx->source_url, NULL, NULL) != 0) {
        ESP_LOGE(TAG, "Failed to open input: %s", ctx->source_url);
        return false;
    }
    
    // Find stream info
    if (avformat_find_stream_info(ctx->fmt_ctx, NULL) < 0) {
        ESP_LOGE(TAG, "Failed to find stream info");
        return false;
    }
    
    // Find video stream
    ctx->video_stream_idx = -1;
    for (int i = 0; i < ctx->fmt_ctx->nb_streams; i++) {
        if (ctx->fmt_ctx->streams[i]->codecpar->codec_type == AVMEDIA_TYPE_VIDEO) {
            ctx->video_stream_idx = i;
            break;
        }
    }
    
    if (ctx->video_stream_idx == -1) {
        ESP_LOGE(TAG, "No video stream found");
        return false;
    }
    
    ctx->video_stream = ctx->fmt_ctx->streams[ctx->video_stream_idx];
    
    // Find decoder
    AVCodec *dec = avcodec_find_decoder(ctx->video_stream->codecpar->codec_id);
    if (!dec) {
        ESP_LOGE(TAG, "Failed to find decoder");
        return false;
    }
    
    // Allocate codec context
    ctx->codec_ctx = avcodec_alloc_context3(dec);
    if (!ctx->codec_ctx) {
        ESP_LOGE(TAG, "Failed to allocate codec context");
        return false;
    }
    
    // Copy codec parameters
    if (avcodec_parameters_to_context(ctx->codec_ctx, ctx->video_stream->codecpar) < 0) {
        ESP_LOGE(TAG, "Failed to copy codec parameters");
        return false;
    }
    
    // Open codec
    if (avcodec_open2(ctx->codec_ctx, dec, NULL) < 0) {
        ESP_LOGE(TAG, "Failed to open codec");
        return false;
    }
    
    // Update video dimensions
    ctx->width = ctx->codec_ctx->width;
    ctx->height = ctx->codec_ctx->height;
    
    // Create scaling context for converting to RGB565
    ctx->sws_ctx = sws_getContext(
        ctx->width, ctx->height, ctx->codec_ctx->pix_fmt,
        ctx->width, ctx->height, AV_PIX_FMT_RGB565,
        SWS_BILINEAR, NULL, NULL, NULL);
    
    if (!ctx->sws_ctx) {
        ESP_LOGE(TAG, "Failed to create scaling context");
        return false;
    }
    
    // Allocate packet and frame
    ctx->packet = av_packet_alloc();
    ctx->frame = av_frame_alloc();
    
    if (!ctx->packet || !ctx->frame) {
        ESP_LOGE(TAG, "Failed to allocate packet or frame");
        return false;
    }
    
    ESP_LOGI(TAG, "MP4 source opened successfully: %dx%d", ctx->width, ctx->height);
    ctx->is_mp4 = true;
    return true;
}

// Read a frame from MP4
static bool read_mp4_frame(esp_ffmpeg_context_t *ctx, uint16_t *rgb565_buffer) {
    int ret;
    bool got_frame = false;
    
    // Read frames until we get a video frame
    while (!got_frame) {
        ret = av_read_frame(ctx->fmt_ctx, ctx->packet);
        
        if (ret < 0) {
            // End of file or error
            if (ret == AVERROR_EOF) {
                // Seek back to beginning for looping
                av_seek_frame(ctx->fmt_ctx, -1, 0, AVSEEK_FLAG_BACKWARD);
                continue;
            } else {
                ESP_LOGE(TAG, "Error reading frame");
                return false;
            }
        }
        
        // Process only video packets
        if (ctx->packet->stream_index == ctx->video_stream_idx) {
            // Send packet to decoder
            ret = avcodec_send_packet(ctx->codec_ctx, ctx->packet);
            if (ret < 0) {
                ESP_LOGE(TAG, "Error sending packet to decoder");
                av_packet_unref(ctx->packet);
                return false;
            }
            
            // Get decoded frame
            ret = avcodec_receive_frame(ctx->codec_ctx, ctx->frame);
            if (ret == 0) {
                // Frame successfully decoded
                got_frame = true;
                
                // Convert frame to RGB565
                const uint8_t *src_data[4] = { ctx->frame->data[0], ctx->frame->data[1], ctx->frame->data[2], NULL };
                int src_linesize[4] = { ctx->frame->linesize[0], ctx->frame->linesize[1], ctx->frame->linesize[2], 0 };
                uint8_t *dst_data[4] = { (uint8_t*)rgb565_buffer, NULL, NULL, NULL };
                int dst_linesize[4] = { ctx->width * sizeof(uint16_t), 0, 0, 0 };
                
