youkorr/movie/components/movie/esp32_ffmpeg.c
                sws_scale(ctx->sws_ctx, src_data, src_linesize, 0, ctx->height, dst_data, dst_linesize);
            } else if (ret != AVERROR(EAGAIN)) {
                ESP_LOGE(TAG, "Error receiving frame from decoder");
                av_packet_unref(ctx->packet);
                return false;
            }
        }
        
        av_packet_unref(ctx->packet);
        
        if (got_frame) {
            break;
        }
    }
    
    return true;
}
// Décodage JPEG fictif (remplacer par tjpgd si besoin)
static bool decode_jpeg(uint8_t *jpeg_data, size_t data_len,
                        uint16_t *rgb565_buffer, int width, int height) {
    // Vérification du header JPEG (SOI marker)
    if (data_len < 2 || jpeg_data[0] != 0xFF || jpeg_data[1] != 0xD8) {
        ESP_LOGE(TAG, "Not a valid JPEG marker. First bytes: 0x%02x 0x%02x", 
                 data_len > 0 ? jpeg_data[0] : 0xFF, 
                 data_len > 1 ? jpeg_data[1] : 0xFF);
        
        // Dump first 16 bytes for debugging
        if (data_len > 0) {
            ESP_LOGI(TAG, "First bytes of data:");
            for (int i = 0; i < (data_len < 16 ? data_len : 16); i++) {
                ESP_LOGI(TAG, "Byte %d: 0x%02x (%c)", i, jpeg_data[i], 
                         (jpeg_data[i] >= 32 && jpeg_data[i] <= 126) ? jpeg_data[i] : '.');
            }
        }
        return false;
    }
    
    // Implémentation simplifiée (à remplacer par un décodeur JPEG réel)
    for (int y = 0; y < height; y++) {
        for (int x = 0; x < width; x++) {
            int offset = ((y * width + x) * 3) % (data_len - 10);
            if (offset < 0) offset = 0;
            uint8_t r = jpeg_data[offset % data_len];
            uint8_t g = jpeg_data[(offset + 1) % data_len];
            uint8_t b = jpeg_data[(offset + 2) % data_len];
            r = r >> 3;
            g = g >> 2;
            b = b >> 3;
            rgb565_buffer[y * width + x] = (r << 11) | (g << 5) | b;
        }
    }
    return true;
}

// Recherche du marqueur JPEG dans un buffer
static int find_jpeg_marker(uint8_t *buffer, size_t buffer_size) {
    for (size_t i = 0; i < buffer_size - 1; i++) {
        if (buffer[i] == 0xFF && buffer[i + 1] == 0xD8) {
            return i;
        }
    }
    return -1;
}

// Parser l'en-tête AVI
static bool parse_avi_header(esp_ffmpeg_context_t *ctx) {
    if (!ctx || !ctx->input_file) return false;
    
    // Revenir au début du fichier
    fseek(ctx->input_file, 0, SEEK_SET);
    
    // Lire le header RIFF
    riff_chunk_t riff_header;
    if (fread(&riff_header, sizeof(riff_chunk_t), 1, ctx->input_file) != 1) {
        ESP_LOGE(TAG, "Failed to read RIFF header");
        return false;
    }
    
    // Vérifier que c'est bien un RIFF
    if (strncmp(riff_header.id, "RIFF", 4) != 0) {
        ESP_LOGE(TAG, "Not a RIFF file");
        return false;
    }
    
    // Lire l'identifiant AVI
    char avi_id[4];
    if (fread(avi_id, 4, 1, ctx->input_file) != 1 || strncmp(avi_id, "AVI ", 4) != 0) {
        ESP_LOGE(TAG, "Not an AVI file");
        return false;
    }
    
    ESP_LOGI(TAG, "Valid AVI file detected");
    ctx->is_avi = true;
    
    // Parcourir les chunks pour trouver les informations nécessaires
    bool found_header = false;
    bool found_movi = false;
    char chunk_id[4];
    uint32_t chunk_size;
    uint32_t frames_count = 0;
    uint32_t stream_format = 0;
    
    while (!feof(ctx->input_file) && !(found_header && found_movi)) {
        // Lire l'identifiant du chunk
        if (fread(chunk_id, 4, 1, ctx->input_file) != 1) break;
        
        // Lire la taille du chunk
        if (fread(&chunk_size, 4, 1, ctx->input_file) != 1) break;
        
        ESP_LOGD(TAG, "Chunk: %.4s, Size: %d", chunk_id, chunk_size);
        
        // Recherche des chunks importants
        if (strncmp(chunk_id, "LIST", 4) == 0) {
            char list_type[4];
            if (fread(list_type, 4, 1, ctx->input_file) != 1) break;
            
            ESP_LOGD(TAG, "List type: %.4s", list_type);
            
            if (strncmp(list_type, "hdrl", 4) == 0) {
                // Traiter l'en-tête pour obtenir la résolution
                char subchunk_id[4];
                uint32_t subchunk_size;
                
                while (!feof(ctx->input_file) && !found_header) {
                    if (fread(subchunk_id, 4, 1, ctx->input_file) != 1) break;
                    if (fread(&subchunk_size, 4, 1, ctx->input_file) != 1) break;
                    
                    ESP_LOGD(TAG, "Subchunk: %.4s, Size: %d", subchunk_id, subchunk_size);
                    
                    if (strncmp(subchunk_id, "avih", 4) == 0) {
                        // MainAVIHeader
                        uint32_t micro_sec_per_frame;
                        if (fread(&micro_sec_per_frame, 4, 1, ctx->input_file) != 1) break;
                        
                        // Ignorer les 8 octets suivants
                        fseek(ctx->input_file, 8, SEEK_CUR);
                        
                        // Lire le nombre de frames
                        if (fread(&frames_count, 4, 1, ctx->input_file) != 1) break;
                        ctx->avi_total_frames = frames_count;
                        
                        // Ignorer le reste du chunk avih
                        fseek(ctx->input_file, subchunk_size - 16, SEEK_CUR);
                    }
                    else if (strncmp(subchunk_id, "strf", 4) == 0) {
                        avi_bitmap_info_header_t bih;
                        if (fread(&bih, sizeof(avi_bitmap_info_header_t), 1, ctx->input_file) != 1) break;
                        
                        ctx->width = bih.width;
                        ctx->height = bih.height;
                        stream_format = bih.compression;
                        
                        // Vérifier si c'est du MJPEG
                        char format_str[5] = {0};
                        memcpy(format_str, &stream_format, 4);
                        ESP_LOGI(TAG, "Video format: %.4s, Width: %d, Height: %d", 
                                format_str, ctx->width, ctx->height);
                        
                        // 'MJPG' en little endian = GPJM
                        ctx->is_mjpeg = (stream_format == 0x47504A4D);
                        
