youkorr/movie/components/movie/esp32_ffmpeg.c
                        found_header = true;
                        
                        // Ignorer le reste du chunk strf
                        fseek(ctx->input_file, subchunk_size - sizeof(avi_bitmap_info_header_t), SEEK_CUR);
                    }
                    else {
                        // Ignorer les chunks inconnus
                        fseek(ctx->input_file, subchunk_size, SEEK_CUR);
                    }
                    
                    // Ajustement pour l'alignement
                    if (subchunk_size % 2 == 1) {
                        fseek(ctx->input_file, 1, SEEK_CUR);
                    }
                }
            }
            else if (strncmp(list_type, "movi", 4) == 0) {
                // On a trouvé les données vidéo
                ctx->avi_data_offset = ftell(ctx->input_file);
                ctx->avi_current_offset = ctx->avi_data_offset;
                found_movi = true;
                
                ESP_LOGI(TAG, "Found movi LIST at offset %ld", ctx->avi_data_offset);
                
                // Estimer la taille des frames si non trouvée précédemment
                if (frames_count > 0 && chunk_size > 4) {
                    ctx->avi_frame_size = (chunk_size - 4) / frames_count;
                    ESP_LOGI(TAG, "Estimated frame size: %d bytes", ctx->avi_frame_size);
                }
                
                // Sortir de la boucle car on a trouvé ce qu'on cherchait
                break;
            }
            else {
                // Ignorer les autres types de list
                fseek(ctx->input_file, chunk_size - 4, SEEK_CUR);  // -4 car on a déjà lu le type de liste
            }
        }
        else {
            // Ignorer les chunks inconnus
            fseek(ctx->input_file, chunk_size, SEEK_CUR);
        }
        
        // Ajustement pour l'alignement
        if (chunk_size % 2 == 1) {
            fseek(ctx->input_file, 1, SEEK_CUR);
        }
    }
    
    if (!found_header || !found_movi) {
        ESP_LOGE(TAG, "AVI file is missing required chunks (hdrl or movi)");
        return false;
    }
    
    // Revenir au début des données vidéo
    fseek(ctx->input_file, ctx->avi_data_offset, SEEK_SET);
    ctx->avi_current_offset = ctx->avi_data_offset;
    
    ESP_LOGI(TAG, "AVI header parsed successfully: %dx%d, %d frames", 
            ctx->width, ctx->height, ctx->avi_total_frames);
    
    return true;
}

// Lire une frame depuis un fichier AVI
static bool read_file_avi_frame(esp_ffmpeg_context_t *ctx, uint8_t *buffer,
                             size_t buffer_size, size_t *bytes_read) {
    if (ctx->input_file == NULL) return false;
    
    // Si on commence la lecture, positionner au début des données
    if (ctx->avi_current_offset == 0) {
        if (!parse_avi_header(ctx)) {
            ESP_LOGE(TAG, "Failed to parse AVI header");
            return false;
        }
    }
    
    // Se positionner au bon endroit si on a modifié la position
    if (ftell(ctx->input_file) != ctx->avi_current_offset) {
        fseek(ctx->input_file, ctx->avi_current_offset, SEEK_SET);
    }
    
    // Lire l'en-tête du chunk
    char chunk_id[4];
    uint32_t chunk_size;
    
    if (fread(chunk_id, 4, 1, ctx->input_file) != 1) {
        ESP_LOGE(TAG, "Failed to read chunk ID or end of file");
        // Essai de rebouclage sur le fichier
        fseek(ctx->input_file, ctx->avi_data_offset, SEEK_SET);
        ctx->avi_current_offset = ctx->avi_data_offset;
        return false;
    }
    
    if (fread(&chunk_size, 4, 1, ctx->input_file) != 1) {
        ESP_LOGE(TAG, "Failed to read chunk size");
        return false;
    }
    
    // Vérifier si c'est un chunk de données vidéo (00dc, 00db, etc.)
    if (chunk_id[0] == '0' && chunk_id[1] == '0' && 
        (chunk_id[2] == 'd' || chunk_id[2] == 'w') && 
        (chunk_id[3] == 'c' || chunk_id[3] == 'b')) {
        
        ESP_LOGD(TAG, "Video chunk: %.4s, Size: %d", chunk_id, chunk_size);
        
        // Limiter à la taille du buffer
        size_t to_read = chunk_size > buffer_size ? buffer_size : chunk_size;
        
        *bytes_read = fread(buffer, 1, to_read, ctx->input_file);
        
        if (*bytes_read <= 0) {
            ESP_LOGE(TAG, "Failed to read frame data");
            return false;
        }
        
        // Si MJPEG et pas de marqueur JPEG au début, chercher le marqueur
        if (ctx->is_mjpeg && (buffer[0] != 0xFF || buffer[1] != 0xD8)) {
            int marker_pos = find_jpeg_marker(buffer, *bytes_read);
            if (marker_pos >= 0) {
                ESP_LOGD(TAG, "Found JPEG marker at position %d", marker_pos);
                memmove(buffer, buffer + marker_pos, *bytes_read - marker_pos);
                *bytes_read -= marker_pos;
            } else {
                ESP_LOGE(TAG, "No JPEG marker found in frame data");
                return false;
            }
        }
        
        // Mettre à jour l'offset pour la prochaine lecture
        ctx->avi_current_offset = ftell(ctx->input_file);
        
        // Ajustement pour l'alignement
        if (chunk_size % 2 == 1) {
            fseek(ctx->input_file, 1, SEEK_CUR);
            ctx->avi_current_offset = ftell(ctx->input_file);
        }
        
        return true;
    }
    else {
        // Ce n'est pas un chunk vidéo, l'ignorer
        ESP_LOGD(TAG, "Skipping non-video chunk: %.4s, Size: %d", chunk_id, chunk_size);
        fseek(ctx->input_file, chunk_size, SEEK_CUR);
        
        // Ajustement pour l'alignement
        if (chunk_size % 2 == 1) {
            fseek(ctx->input_file, 1, SEEK_CUR);
        }
        
        ctx->avi_current_offset = ftell(ctx->input_file);
        
        // Si on atteint la fin du fichier, revenir au début des données
        if (feof(ctx->input_file) || ctx->avi_current_offset >= ctx->avi_data_offset + chunk_size) {
            ESP_LOGI(TAG, "Reached end of AVI file, restarting");
            fseek(ctx->input_file, ctx->avi_data_offset, SEEK_SET);
            ctx->avi_current_offset = ctx->avi_data_offset;
        }
        
        // Continuer à chercher un chunk vidéo
        return read_file_avi_frame(ctx, buffer, buffer_size, bytes_read);
    }
}

// Lecture d'une frame MJPEG depuis un fichier
static bool read_file_mjpeg_frame(esp_ffmpeg_context_t *ctx, uint8_t *buffer,
                             size_t buffer_size, size_t *bytes_read) {
    if (ctx->input_file == NULL) return false;
    
    // Si c'est un fichier AVI, utiliser le lecteur AVI
    if (ctx->is_avi) {
        return read_file_avi_frame(ctx, buffer, buffer_size, bytes_read);
    }
    
    // Sinon, utiliser le lecteur MJPEG original
    // Recherche du début d'un JPEG (SOI marker: FF D8)
    uint8_t marker[2];
    bool found_start = false;
    
    while (!found_start && !feof(ctx->input_file)) {
        size_t read = fread(marker, 1, 2, ctx->input_file);
        if (read != 2) break;
        
        if (marker[0] == 0xFF && marker[1] == 0xD8) {
            found_start = true;
            fseek(ctx->input_file, -2, SEEK_CUR);  // Revenir au début du marqueur
        } else {
            fseek(ctx->input_file, -1, SEEK_CUR);  // Avancer d'un octet seulement
        }
    }
    
    if (!found_start) return false;
    
    // Lire les données du JPEG
    *bytes_read = fread(buffer, 1, buffer_size, ctx->input_file);
    return (*bytes_read > 0);
}

