youkorr/movie/components/movie/esp32_ffmpeg.c
// Lecture d'une frame MJPEG depuis HTTP
static bool read_http_mjpeg_frame(esp_ffmpeg_context_t *ctx, uint8_t *buffer,
                             size_t buffer_size, size_t *bytes_read) {
    esp_err_t err;
    
    // Si c'est la première requête ou si on a besoin de réinitialiser
    if (ctx->http_client == NULL) {
        esp_http_client_config_t config = {
            .url = ctx->source_url,
            .timeout_ms = 5000,
            .buffer_size = buffer_size,
        };
        ctx->http_client = esp_http_client_init(&config);
        if (ctx->http_client == NULL) {
            ESP_LOGE(TAG, "Failed to initialize HTTP client");
            return false;
        }
    }
    
    // Ouvrir la connexion
    err = esp_http_client_open(ctx->http_client, 0);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to open HTTP connection: %s", esp_err_to_name(err));
        esp_http_client_cleanup(ctx->http_client);
        ctx->http_client = NULL;
        return false;
    }
    
    // Récupérer les headers
    int content_length = esp_http_client_fetch_headers(ctx->http_client);
    if (content_length < 0) {
        ESP_LOGE(TAG, "HTTP client fetch headers failed");
        esp_http_client_close(ctx->http_client);
        return false;
    }
    
    // Limiter la lecture au buffer_size
    int to_read = content_length > 0 && content_length < buffer_size ? 
                  content_length : buffer_size;
    
    // Lire le corps
    int total_read = 0;
    int remaining = to_read;
    
    while (remaining > 0) {
        int read_len = esp_http_client_read(ctx->http_client, 
                                           (char*)buffer + total_read, 
                                           remaining);
        if (read_len <= 0) {
            break;
        }
        total_read += read_len;
        remaining -= read_len;
    }
    
    esp_http_client_close(ctx->http_client);
    
    if (total_read <= 0) {
        ESP_LOGE(TAG, "HTTP client read failed");
        return false;
    }
    
    *bytes_read = total_read;
    
    // Vérifier si les données commencent par un marqueur JPEG
    // Si non, rechercher le marqueur dans les données
    if (buffer[0] != 0xFF || buffer[1] != 0xD8) {
        ESP_LOGW(TAG, "HTTP data doesn't start with JPEG marker, looking for marker");
        int marker_pos = find_jpeg_marker(buffer, total_read);
        
        if (marker_pos >= 0) {
            ESP_LOGI(TAG, "Found JPEG marker at position %d", marker_pos);
            // Déplacer les données pour commencer au marqueur
            memmove(buffer, buffer + marker_pos, total_read - marker_pos);
            *bytes_read = total_read - marker_pos;
        } else {
            ESP_LOGE(TAG, "No JPEG marker found in HTTP data");
            return false;
        }
    }
    
    return true;
}

// Lecture d'une frame MJPEG (wrapper)
static bool read_mjpeg_frame(esp_ffmpeg_context_t *ctx, uint8_t *buffer,
                             size_t buffer_size, size_t *bytes_read) {
    if (ctx->source_type == ESP_FFMPEG_SOURCE_TYPE_FILE) {
        return read_file_mjpeg_frame(ctx, buffer, buffer_size, bytes_read);
    }
    else if (ctx->source_type == ESP_FFMPEG_SOURCE_TYPE_HTTP) {
        return read_http_mjpeg_frame(ctx, buffer, buffer_size, bytes_read);
    }
    return false;
}

// Tâche de décodage
static void ffmpeg_decode_task(void *arg) {
    esp_ffmpeg_context_t *ctx = (esp_ffmpeg_context_t *)arg;
    
    if (!ctx || !ctx->buffer) {
        ESP_LOGE(TAG, "Invalid context in decoder task");
        vTaskDelete(NULL);
        return;
    }
    
    ESP_LOGI(TAG, "Decoder task started with stack size: %d", uxTaskGetStackHighWaterMark(NULL));

    // Detect MP4 format based on extension or HTTP content type
    if (ctx->source_url && strstr(ctx->source_url, ".mp4") != NULL) {
        if (!open_mp4_source(ctx)) {
            ESP_LOGE(TAG, "Failed to open MP4 source");
            ctx->running = false;
            vTaskDelete(NULL);
            return;
        }
    }

    // Allocate the RGB565 buffer
    size_t rgb565_size = ctx->width * ctx->height * sizeof(uint16_t);
    uint16_t *rgb565_buffer = NULL;
    
#if CONFIG_SPIRAM
    rgb565_buffer = heap_caps_malloc(rgb565_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    ESP_LOGI(TAG, "Allocated RGB565 buffer in SPIRAM");
#else
    rgb565_buffer = malloc(rgb565_size);
    ESP_LOGI(TAG, "Allocated RGB565 buffer in internal memory");
#endif

    if (!rgb565_buffer) {
        ESP_LOGE(TAG, "Failed to allocate RGB565 buffer (size: %d bytes)", rgb565_size);
        ctx->running = false;
        vTaskDelete(NULL);
        return;
    }

    esp_ffmpeg_frame_t frame = {
        .data = (uint8_t *)rgb565_buffer,
        .size = rgb565_size,
        .width = ctx->width,
        .height = ctx->height,
        .pts = 0
    };

    const TickType_t delay_time = pdMS_TO_TICKS(33); // ~30 FPS
    int consecutive_errors = 0;
    const int max_consecutive_errors = 5;

    while (ctx->running) {
        bool success = false;
        
        // Process based on format
        if (ctx->is_mp4) {
            success = read_mp4_frame(ctx, rgb565_buffer);
        } else if (ctx->is_avi || ctx->is_mjpeg) {
            size_t bytes_read = 0;
            success = read_mjpeg_frame(ctx, ctx->buffer, ctx->buffer_size, &bytes_read);
            
            if (success) {
                success = decode_jpeg(ctx->buffer, bytes_read, rgb565_buffer, ctx->width, ctx->height);
            }
        }
        
        if (!success) {
            ESP_LOGW(TAG, "Failed to read/decode frame, consecutive errors: %d", ++consecutive_errors);
            
            if (consecutive_errors >= max_consecutive_errors) {
                ESP_LOGE(TAG, "Too many consecutive errors, stopping decoder");
                break;
            }
            
            vTaskDelay(delay_time);
            continue;
        }
        
        consecutive_errors = 0;
        frame.pts++;
        
        // Call the callback if defined
        if (ctx->frame_callback) {
            ctx->frame_callback(&frame, ctx->user_data);
        }
        
        ctx->frame_count++;
        vTaskDelay(delay_time);
    }

