youkorr/movie/components/movie/esp32_ffmpeg.c
    // Cleanup
    free(rgb565_buffer);
    
    // Clean up FFmpeg resources if needed
    if (ctx->is_mp4) {
        if (ctx->sws_ctx) sws_freeContext(ctx->sws_ctx);
        if (ctx->frame) av_frame_free(&ctx->frame);
        if (ctx->packet) av_packet_free(&ctx->packet);
        if (ctx->codec_ctx) {
            avcodec_close(ctx->codec_ctx);
            avcodec_free_context(&ctx->codec_ctx);
        }
        if (ctx->fmt_ctx) {
            avformat_close_input(&ctx->fmt_ctx);
            avformat_free_context(ctx->fmt_ctx);
        }
    }
    
    ESP_LOGI(TAG, "Decoder task finished, processed %d frames", ctx->frame_count);

    ctx->running = false;
    vTaskDelete(NULL);
}
esp_err_t esp_ffmpeg_init(const char *source_url,
                         esp_ffmpeg_source_type_t source_type,
                         esp_ffmpeg_frame_callback_t frame_callback,
                         void *user_data,
                         esp_ffmpeg_context_t **ctx) {
    if (!source_url || !ctx) return ESP_ERR_INVALID_ARG;

    esp_ffmpeg_context_t *new_ctx = calloc(1, sizeof(esp_ffmpeg_context_t));
    if (!new_ctx) return ESP_ERR_NO_MEM;

    new_ctx->source_url = strdup(source_url);
    new_ctx->source_type = source_type;
    new_ctx->frame_callback = frame_callback;
    new_ctx->user_data = user_data;
    new_ctx->running = false;
    new_ctx->mutex = xSemaphoreCreateMutex();
    new_ctx->width = 128;   // Valeurs par défaut adaptées à ton écran
    new_ctx->height = 64;
    new_ctx->frame_count = 0;
    new_ctx->is_mjpeg = true;
    new_ctx->is_avi = false;
    new_ctx->is_mp4 = false;
    new_ctx->avi_data_offset = 0;
    new_ctx->avi_current_offset = 0;
    new_ctx->avi_frame_size = 0;
    new_ctx->avi_total_frames = 0;
    new_ctx->http_client = NULL;
    new_ctx->input_file = NULL;

    // Buffer de décodage (PSRAM si dispo)
    new_ctx->buffer_size = 32768; // 32 Ko (doublé par rapport à l'original)
#if CONFIG_SPIRAM
    new_ctx->buffer = heap_caps_malloc(new_ctx->buffer_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    ESP_LOGI(TAG, "Allocated decoder buffer in SPIRAM");
#else
    new_ctx->buffer = malloc(new_ctx->buffer_size);
    ESP_LOGI(TAG, "Allocated decoder buffer in internal memory");
#endif

    if (!new_ctx->buffer) {
        ESP_LOGE(TAG, "Failed to allocate decoder buffer (size: %d bytes)", new_ctx->buffer_size);
        free(new_ctx->source_url);
        vSemaphoreDelete(new_ctx->mutex);
        free(new_ctx);
        return ESP_ERR_NO_MEM;
    }

    if (source_type == ESP_FFMPEG_SOURCE_TYPE_FILE) {
        new_ctx->input_file = fopen(source_url, "rb");
        if (!new_ctx->input_file) {
            ESP_LOGE(TAG, "Failed to open file: %s", source_url);
            free(new_ctx->buffer);
            free(new_ctx->source_url);
            vSemaphoreDelete(new_ctx->mutex);
            free(new_ctx);
            return ESP_ERR_NOT_FOUND;
        }
        
        // Vérifier si c'est un fichier AVI
        char file_header[12];
        size_t read_bytes = fread(file_header, 1, 12, new_ctx->input_file);
        fseek(new_ctx->input_file, 0, SEEK_SET); // Revenir au début
        
        if (read_bytes >= 12 && 
            strncmp(file_header, "RIFF", 4) == 0 && 
            strncmp(file_header + 8, "AVI ", 4) == 0) {
            ESP_LOGI(TAG, "File is in AVI format");
            new_ctx->is_avi = true;
        }
    }
    // HTTP client sera initialisé dans la tâche pour éviter les problèmes de timeout

    *ctx = new_ctx;
    ESP_LOGI(TAG, "FFmpeg context initialized for %s", source_url);
    return ESP_OK;
}

esp_err_t esp_ffmpeg_start(esp_ffmpeg_context_t *ctx) {
    if (!ctx) return ESP_ERR_INVALID_ARG;
    if (ctx->running) return ESP_OK;
    
    ctx->running = true;
    BaseType_t ret = xTaskCreate(
        ffmpeg_decode_task,
        "ffmpeg_decode",
        4096, // Stack doublée
        ctx,
        tskIDLE_PRIORITY + 1,
        &ctx->task_handle
    );
    
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create decoder task");
        ctx->running = false;
        return ESP_FAIL;
    }
    
    return ESP_OK;
}

esp_err_t esp_ffmpeg_stop(esp_ffmpeg_context_t *ctx) {
    if (!ctx) return ESP_ERR_INVALID_ARG;
    if (!ctx->running) return ESP_OK;
    
    // Signal the task to stop
    ctx->running = false;
    
    // Wait for the task to finish cleanly
    vTaskDelay(pdMS_TO_TICKS(200));
    
    // Clean up resources based on source type
    if (ctx->source_type == ESP_FFMPEG_SOURCE_TYPE_FILE && ctx->input_file) {
        fclose(ctx->input_file);
        ctx->input_file = NULL;
    }
    else if (ctx->source_type == ESP_FFMPEG_SOURCE_TYPE_HTTP && ctx->http_client) {
        esp_http_client_cleanup(ctx->http_client);
        ctx->http_client = NULL;
    }
    
    // Clean up FFmpeg resources if needed (already done in task, this is a backup)
    if (ctx->is_mp4) {
        if (ctx->sws_ctx) sws_freeContext(ctx->sws_ctx);
        if (ctx->frame) av_frame_free(&ctx->frame);
        if (ctx->packet) av_packet_free(&ctx->packet);
        if (ctx->codec_ctx) {
            avcodec_close(ctx->codec_ctx);
            avcodec_free_context(&ctx->codec_ctx);
        }
        if (ctx->fmt_ctx) {
            avformat_close_input(&ctx->fmt_ctx);
            avformat_free_context(ctx->fmt_ctx);
        }
    }
    
    // Free memory
    free(ctx->buffer);
    free(ctx->source_url);
    vSemaphoreDelete(ctx->mutex);
    free(ctx);
    
    return ESP_OK;
}


esp_err_t esp_ffmpeg_convert_frame(uint16_t *src, void *dst, int width, int height, int dst_format) {
    if (!src || !dst) return ESP_ERR_INVALID_ARG;
    
    switch (dst_format) {
        case 0:  // RGB565 -> RGB565 (copie)
            memcpy(dst, src, width * height * sizeof(uint16_t));
            break;
        case 1:  // RGB565 -> RGB888
            for (int i = 0; i < width * height; i++) {
                uint16_t pixel = src[i];
                uint8_t *rgb = (uint8_t *)dst + (i * 3);
                rgb[0] = ((pixel >> 11) & 0x1F) << 3;  // R
                rgb[1] = ((pixel >> 5) & 0x3F) << 2;   // G
                rgb[2] = ((pixel) & 0x1F) << 3;        // B
            }
            break;
        case 2:  // RGB565 -> Grayscale
            for (int i = 0; i < width * height; i++) {
                uint16_t pixel = src[i];
                uint8_t r = ((pixel >> 11) & 0x1F) << 3;
                uint8_t g = ((pixel >> 5) & 0x3F) << 2;
                uint8_t b = ((pixel) & 0x1F) << 3;
                uint8_t gray = (r * 30 + g * 59 + b * 11) / 100;
                ((uint8_t *)dst)[i] = gray;
            }
            break;
        default:
            return ESP_ERR_INVALID_ARG;
    }
    
    return ESP_OK;
}





